#include <iostream>


int main()
{
	int n, m, k;
	std::cin >> n >> m >> k;

	if ((k % n == 0 && k <= n * m) || (k % m == 0 && k <= n * m)) {
		std::cout << "YES";
	}
	else {
		std::cout << "NO";
	}

	return 0;
}

//Шоколадка N×M долек. 
//Шоколадку можно один раз разломить по прямой на две части. 
//Определите, можно ли таким образом отломить от шоколадки ровно K долек.